data/sysbench/c2j_shadowing/rndrw/150G/sdd1thread1
WARNING: --max-time is deprecated, use --time instead
sysbench 1.0.11 (using system LuaJIT 2.1.0-beta3)

Running the test with following options:
Number of threads: 1
Initializing random number generator from current time


Extra file open flags: 0
128 files, 1.1719GiB each
150GiB total file size
Block size 16KiB
Number of IO requests: 0
Read/Write ratio for combined random IO test: 1.50
Calling fsync() after each write operation.
Using synchronous I/O mode
Doing random r/w test
Initializing worker threads...

Threads started!


File operations:
    reads/s:                      503.88
    writes/s:                     335.93
    fsyncs/s:                     335.93

Throughput:
    read, MiB/s:                  7.87
    written, MiB/s:               5.25

General statistics:
    total time:                          60.0004s
    total number of events:              50392

Latency (ms):
         min:                                  0.01
         avg:                                  1.19
         max:                                 16.45
         95th percentile:                      2.76
         sum:                              59905.41

Threads fairness:
    events (avg/stddev):           50392.0000/0.00
    execution time (avg/stddev):   59.9054/0.00

WARNING: --max-time is deprecated, use --time instead
sysbench 1.0.11 (using system LuaJIT 2.1.0-beta3)

Running the test with following options:
Number of threads: 1
Initializing random number generator from current time


Extra file open flags: 0
128 files, 1.1719GiB each
150GiB total file size
Block size 16KiB
Number of IO requests: 0
Read/Write ratio for combined random IO test: 1.50
Calling fsync() after each write operation.
Using synchronous I/O mode
Doing random r/w test
Initializing worker threads...

Threads started!


File operations:
    reads/s:                      501.32
    writes/s:                     334.22
    fsyncs/s:                     334.22

Throughput:
    read, MiB/s:                  7.83
    written, MiB/s:               5.22

General statistics:
    total time:                          60.0014s
    total number of events:              50137

Latency (ms):
         min:                                  0.01
         avg:                                  1.19
         max:                                 16.05
         95th percentile:                      2.76
         sum:                              59909.46

Threads fairness:
    events (avg/stddev):           50137.0000/0.00
    execution time (avg/stddev):   59.9095/0.00

WARNING: --max-time is deprecated, use --time instead
sysbench 1.0.11 (using system LuaJIT 2.1.0-beta3)

Running the test with following options:
Number of threads: 1
Initializing random number generator from current time


Extra file open flags: 0
128 files, 1.1719GiB each
150GiB total file size
Block size 16KiB
Number of IO requests: 0
Read/Write ratio for combined random IO test: 1.50
Calling fsync() after each write operation.
Using synchronous I/O mode
Doing random r/w test
Initializing worker threads...

Threads started!


File operations:
    reads/s:                      500.58
    writes/s:                     333.73
    fsyncs/s:                     333.73

Throughput:
    read, MiB/s:                  7.82
    written, MiB/s:               5.21

General statistics:
    total time:                          60.0007s
    total number of events:              50062

Latency (ms):
         min:                                  0.01
         avg:                                  1.20
         max:                                 20.80
         95th percentile:                      2.76
         sum:                              59907.53

Threads fairness:
    events (avg/stddev):           50062.0000/0.00
    execution time (avg/stddev):   59.9075/0.00